# GetSymbolGeometryId Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
InstanceNode..::..GetSymbolGeometryId Method
InstanceNode Class See Also
---
Gets the SymbolGeometryId associated with the node.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public SymbolGeometryId GetSymbolGeometryId()
```

Visual Basic
---
```text
Public Function GetSymbolGeometryId As SymbolGeometryId
```

Visual C++
---
```text
public:
SymbolGeometryId^ GetSymbolGeometryId()
```

# Remarks
Use the strings returned by SymbolGeometryId.AsIdentifier(bool) to check if two nodes point to the same geometry of the symbol.
# See Also
InstanceNode Class
Autodesk.Revit.DB Namespace